## File IO

In [1]:
f = open("story.txt")

In [2]:
f

In [3]:
print(f)

<_io.TextIOWrapper name='story.txt' mode='r' encoding='cp936'>

In [4]:
# 通过使用read()来读取内容
f.read()

'It is a short story that be used to test by using Python.'

In [7]:
# readline()函数
f.readline()

'It is a short story that be used to test by using Python.'

In [9]:
# 不适用with
file = open("story.txt")
file.read()
file.close()

file.closed  # 关闭，返回True

True

In [10]:
# 使用with来进行
with open("story.txt") as file:
    file.read()
file.closed  # 返回True

True

In [14]:
# 使用write来进行写入
with open("write_story.txt", "w") as file:
    file.write("Writing files is great\n")
    file.write("Here is another line of text\n")
    file.write("Closing now, goodbye!")
file.closed

True

## CSV

csv的内容如下所示：
```
Name,Country,Height (in cm)
Ryu,Japan,175
Ken,USA,175
Chun-Li,China,165
Guile,USA,182
E. Honda,Japan,185
Dhalsim,India,176
Blanka,Brazil,192
Zangief,Russia,214
```
CSV的名称为 "1 - fighters.csv"

In [17]:
# 使用 reader
from csv import reader
with open ("1 - fighters.csv") as file:
    csv_reader = reader(file)
    for row in csv_reader:
        print(row)

['Name', 'Country', 'Height (in cm)']
['Ryu', 'Japan', '175']
['Ken', 'USA', '175']
['Chun-Li', 'China', '165']
['Guile', 'USA', '182']
['E. Honda', 'Japan', '185']
['Dhalsim', 'India', '176']
['Blanka', 'Brazil', '192']
['Zangief', 'Russia', '214']

In [18]:
# 使用 DictReader
from csv import DictReader
with open("1 - fighters.csv") as file:
    csv_reader = DictReader(file)
    for row in csv_reader:
        print(row)

{'Name': 'Ryu', 'Country': 'Japan', 'Height (in cm)': '175'}
{'Name': 'Ken', 'Country': 'USA', 'Height (in cm)': '175'}
{'Name': 'Chun-Li', 'Country': 'China', 'Height (in cm)': '165'}
{'Name': 'Guile', 'Country': 'USA', 'Height (in cm)': '182'}
{'Name': 'E. Honda', 'Country': 'Japan', 'Height (in cm)': '185'}
{'Name': 'Dhalsim', 'Country': 'India', 'Height (in cm)': '176'}
{'Name': 'Blanka', 'Country': 'Brazil', 'Height (in cm)': '192'}
{'Name': 'Zangief', 'Country': 'Russia', 'Height (in cm)': '214'}

In [24]:
from csv import reader
with open ("1 - fighters.csv") as file:
    csv_reader = reader(file)
    for fighter in csv_reader:
        print(f"{fighter[0]} is from {fighter[1]}")
        # print(row)

Name is from Country
Ryu is from Japan
Ken is from USA
Chun-Li is from China
Guile is from USA
E. Honda is from Japan
Dhalsim is from India
Blanka is from Brazil
Zangief is from Russia

In [26]:
# 使用pandas来进行读取
import pandas as pd

fighter = pd.read_csv("1 - fighters.csv")
fighter

       Name Country  Height (in cm)
0       Ryu   Japan             175
1       Ken     USA             175
2   Chun-Li   China             165
3     Guile     USA             182
4  E. Honda   Japan             185
5   Dhalsim   India             176
6    Blanka  Brazil             192
7   Zangief  Russia             214

In [28]:
fighter["Name"]

0         Ryu
1         Ken
2     Chun-Li
3       Guile
4    E. Honda
5     Dhalsim
6      Blanka
7     Zangief
Name: Name, dtype: object

In [29]:
fighter["Country"]

0     Japan
1       USA
2     China
3       USA
4     Japan
5     India
6    Brazil
7    Russia
Name: Country, dtype: object

In [31]:
fighter["Height (in cm)"]

0    175
1    175
2    165
3    182
4    185
5    176
6    192
7    214
Name: Height (in cm), dtype: int64

In [35]:
fighter.head(5)

       Name Country  Height (in cm)
0       Ryu   Japan             175
1       Ken     USA             175
2   Chun-Li   China             165
3     Guile     USA             182
4  E. Honda   Japan             185

In [36]:
fighter.head(3)

      Name Country  Height (in cm)
0      Ryu   Japan             175
1      Ken     USA             175
2  Chun-Li   China             165

In [37]:
fighter.tail(3)

      Name Country  Height (in cm)
5  Dhalsim   India             176
6   Blanka  Brazil             192
7  Zangief  Russia             214

In [42]:
fighter[:4]

      Name Country  Height (in cm)
0      Ryu   Japan             175
1      Ken     USA             175
2  Chun-Li   China             165
3    Guile     USA             182

In [41]:
fighter[0:5]

       Name Country  Height (in cm)
0       Ryu   Japan             175
1       Ken     USA             175
2   Chun-Li   China             165
3     Guile     USA             182
4  E. Honda   Japan             185